src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.УведомленияПрограммы</basedOn>
  <basedOn>Document.Отсутствие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОснование</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВидаМаршрутизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ЛичныеАдресаты/ЛичныеАдресаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛичныеАдресаты</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыЛичныхАдресатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФотографии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ИсходящееПисьмо/Forms/ВводПолучателяПисьма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче 
	// параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("ОсновнойАдресПочты") Тогда		
		Если ЗначениеЗаполнено(Параметры.ОсновнойАдресПочты) Тогда
			ОсновнойАдресПочты = Параметры.ОсновнойАдресПочты;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийПользователь") Тогда
		Если ЗначениеЗаполнено(Параметры.ТекущийПользователь) Тогда
			ТекущийПользователь = Параметры.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполненыПараметрыEmailУчетнойЗаписи") Тогда
		Если ЗначениеЗаполнено(Параметры.ЗаполненыПараметрыEmailУчетнойЗаписи) Тогда
			ЗаполненыПараметрыEmailУчетнойЗаписи = Параметры.ЗаполненыПараметрыEmailУчетнойЗаписи;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("УчетнаяЗапись") Тогда
		Если ЗначениеЗаполнено(Параметры.УчетнаяЗапись) Тогда
			УчетнаяЗапись = Параметры.УчетнаяЗапись;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("АвтоподборАдресатовПриВводе") Тогда
		Если ЗначениеЗаполнено(Параметры.АвтоподборАдресатовПриВводе) Тогда
			АвтоподборАдресатовПриВводе = Параметры.АвтоподборАдресатовПриВводе;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		|	ИспользованиеАдресатовПользователями.Адресат КАК Адресат,
		|	АдресатыПочтовыхСообщений.Адрес КАК Адрес,
		|	ИспользованиеАдресатовПользователями.ДатаПоследнегоИспользования КАК ДатаПоследнегоИспользования
		|ИЗ
		|	РегистрСведений.ИспользованиеАдресатовПользователями КАК ИспользованиеАдресатовПользователями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресатыПочтовыхСообщений КАК АдресатыПочтовыхСообщений
		|		ПО ИспользованиеАдресатовПользователями.Адресат = АдресатыПочтовыхСообщений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАдресатах КАК СведенияОбАдресатах
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеАдресаты КАК ЛичныеАдресаты
		|			ПО СведенияОбАдресатах.Контакт = ЛичныеАдресаты.Ссылка
		|		ПО ИспользованиеАдресатовПользователями.Адресат = СведенияОбАдресатах.АдресатСообщения
		|ГДЕ
		|	ИспользованиеАдресатовПользователями.Пользователь = &Пользователь
		|	И (ЛичныеАдресаты.Пользователь ЕСТЬ NULL
		|			ИЛИ ЛичныеАдресаты.Пользователь = &Пользователь)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоследнегоИспользования УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НедавниеАдресаты.Добавить();
		НоваяСтрока.Выбран = Ложь;
		
		ДанныеАдресата = 
			РаботаСоСтрокамиКлиентСервер.РазложитьПредставлениеАдресаЭлектроннойПочты(
				Строка(Выборка.Адресат));
		
		ДанныеАдресата =
			РаботаСоСтрокамиКлиентСервер.РазложитьПредставлениеАдресаЭлектроннойПочты(Выборка.Адресат);
		
		НоваяСтрока.Адресат = Выборка.Адресат;
		НоваяСтрока.Адрес = ДанныеАдресата.Адрес;
		
		Если ЗначениеЗаполнено(ДанныеАдресата.ОтображаемоеИмя) Тогда
			НоваяСтрока.Представление = ДанныеАдресата.ОтображаемоеИмя;
		Иначе
			НоваяСтрока.Представление = ДанныеАдресата.Адрес;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.НедавниеАдресаты.Видимость = НедавниеАдресаты.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("УстановитьФокусНаПолучателя", 0.2, Истина);

	ЭтаФорма.ТекущийЭлемент = Элементы.ПолучательПредставление;
#Если МобильныйКлиент Тогда	
	ЭтаФорма.НачатьРедактированиеЭлемента();
#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НедавниеАдресатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НедавниеАдресаты.ТекущиеДанные;
	ТекущиеДанные.Выбран = Не ТекущиеДанные.Выбран;
	
	Готово(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолучательПредставление = ВыбранноеЗначение.Представление;
	ПолучательАдрес = ВыбранноеЗначение.Адрес;
	ПолучательАдресат = ВыбранноеЗначение.Адресат;
	
	ЗакрытьФормуИВернутьСписокВыбранных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
	СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Текст) < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВебКлиент = Ложь;
#Если ВебКлиент Тогда
	ЭтоВебКлиент = Истина;
#КонецЕсли
	
	ИскатьПоГруппам = Истина;

	ДанныеВыбора = ВстроеннаяПочтаСервер.ПолучитьДанныеВыбораДляЭлектронногоПисьма(Текст,
		ТекущийПользователь,
		ЭтоВебКлиент,
		ИскатьПоГруппам);

	ВстроеннаяПочтаКлиент.ЗаполнитьКартинкиВСпискеВыбора(ДанныеВыбора);
	
	Если ДанныеВыбора.Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)

	ЗакрытьФормуИВернутьСписокВыбранных();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьФокусНаПолучателя()

	ТекущийЭлемент = Элементы.ПолучательПредставление;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляАдреса(ДанныеАдресата)
	
	ПолучательАдресат = ДанныеАдресата.ПолноеИмя;
	Если Не ЗначениеЗаполнено(ДанныеАдресата.ОтображаемоеИмя) Тогда
		ПолучательПредставление = ДанныеАдресата.Адрес;
	Иначе
		ПолучательПредставление = ДанныеАдресата.ОтображаемоеИмя;
	КонецЕсли;
	
	ПолучательАдрес = ДанныеАдресата.Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуИВернутьСписокВыбранных()

	ОчиститьСообщения();
	МассивДляВозврата = Новый Массив;

	Для Каждого Строка Из НедавниеАдресаты Цикл
		Если (Строка.Выбран) Тогда
			
			АдресатИнфо = ПолучитьАдресатИнфо(Строка.Адрес);
			
			СтруктураВозврата = НоваяСтруктураСведенийОбАдресате();
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, АдресатИнфо);
			СтруктураВозврата.Представление = АдресатИнфо.Наименование;
			СтруктураВозврата.Адрес = Строка.Адрес;
			
			Если МассивДляВозврата.Найти(СтруктураВозврата) = Неопределено Тогда
				МассивДляВозврата.Добавить(СтруктураВозврата);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПолучательПредставление) Тогда

		Если Не ЗначениеЗаполнено(ПолучательАдресат) Тогда

			// Пытаемся получить адрес электронной почты.
			ДанныеАдресата = 
				РаботаСоСтрокамиКлиентСервер.РазложитьПредставлениеАдресаЭлектроннойПочты(
					ПолучательПредставление);

			Если РаботаСоСтрокамиКлиентСервер.ЭтоАдресЭлектроннойПочты(ДанныеАдресата.Адрес) Тогда
				ЗаполнитьПоляАдреса(ДанныеАдресата);

			Иначе
				ТекстСообщения = 
					СтрШаблон(
						НСтр("ru = 'Некорректный адрес электронной почты ""%1""'"),
						ПолучательПредставление);

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,, "ПолучательПредставление");

				Возврат;

			КонецЕсли;

		КонецЕсли;
		
		АдресатИнфо = ПолучитьАдресатИнфо(ПолучательАдрес);
		
		СтруктураВозврата = НоваяСтруктураСведенийОбАдресате();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, АдресатИнфо);
		СтруктураВозврата.Адрес = ПолучательАдрес;
		
		Если (АдресатИнфо.Свойство("Наименование")) Тогда
			СтруктураВозврата.Представление = АдресатИнфо.Наименование;
		Иначе
			СтруктураВозврата.Представление = ПолучательПредставление;
		КонецЕсли;
		
		МассивДляВозврата.Добавить(СтруктураВозврата);
		
	КонецЕсли;
	
	Оповестить("ВыбраныПолучатели", МассивДляВозврата);
	
	// В МК форма уже может быть закрыта.
	Если ЭтотОбъект.Открыта() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресатИнфо(Адрес)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АдресатыПочтовыхСообщений.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(МИНИМУМ(СведенияОбАдресатах.Контакт), НЕОПРЕДЕЛЕНО) КАК Контакт,
		|	АдресатыПочтовыхСообщений.Наименование КАК Наименование,
		|	АдресатыПочтовыхСообщений.ВидМаршрутизации КАК ВидМаршрутизации
		|ИЗ
		|	Справочник.АдресатыПочтовыхСообщений КАК АдресатыПочтовыхСообщений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАдресатах КАК СведенияОбАдресатах
		|		ПО АдресатыПочтовыхСообщений.Ссылка = СведенияОбАдресатах.АдресатСообщения
		|			И (СведенияОбАдресатах.Активна)
		|ГДЕ
		|	АдресатыПочтовыхСообщений.Адрес = &Адрес
		|	И НЕ АдресатыПочтовыхСообщений.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	АдресатыПочтовыхСообщений.Ссылка,
		|	АдресатыПочтовыхСообщений.Наименование,
		|	АдресатыПочтовыхСообщений.ВидМаршрутизации");
	
	Запрос.УстановитьПараметр("Адрес", Адрес);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	АдресатИнфо = Новый Структура();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		АдресатИнфо.Вставить("Адресат", ВыборкаДетальныеЗаписи.Ссылка);
		АдресатИнфо.Вставить("Контакт", ВыборкаДетальныеЗаписи.Контакт);
		АдресатИнфо.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		
		Внутренний = ТипЗнч(ВыборкаДетальныеЗаписи.Контакт) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(ВыборкаДетальныеЗаписи.Контакт) = Тип("СправочникСсылка.РолиИсполнителей");
		АдресатИнфо.Вставить("Внешний", Не Внутренний);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Контакт) Тогда
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Контакт) = Тип("СправочникСсылка.Пользователи") Тогда
				ОписаниеОтсутствия =
					Отсутствия.ПолучитьОписаниеТекущегоОтсутствияСотрудника(ВыборкаДетальныеЗаписи.Контакт);
				АдресатИнфо.Вставить("ОписаниеОтсутствия", ОписаниеОтсутствия);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АдресатИнфо;
	
КонецФункции

Функция НоваяСтруктураСведенийОбАдресате()
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("Адресат", Справочники.АдресатыПочтовыхСообщений.ПустаяСсылка());
	СтруктураВозврата.Вставить("ВидМаршрутизации", Перечисления.ВидыМаршрутизацииПисем.Внешняя);
	СтруктураВозврата.Вставить("Представление", Неопределено);
	СтруктураВозврата.Вставить("Контакт", Неопределено);
	СтруктураВозврата.Вставить("Адрес", Неопределено);
	СтруктураВозврата.Вставить("Внешний", Истина);
	СтруктураВозврата.Вставить("ДеньРожденияСегодня", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОтсутствия", Неопределено);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
